export class DonateMessages {
  constructor() {}

  static donateMessage(userWallet?: string | undefined): string {
    const messageText = `
⭐ <b>Поддержите развитие Bot</b>

Каждое пожертвование помогает поддерживать работу бота и добавлять новые функции 🐱✨

Даже небольшой вклад важен — спасибо за любую поддержку!

Как пожертвовать:
1️⃣ Отправьте любую сумму в <b>SOL</b> на ваш <b>кошелек Bot</b>.
2️⃣ Выберите один из <b>вариантов</b> ниже или просто <b>введите</b> сумму, которую хотите пожертвовать (например, для 0.01 SOL напишите "0.01").

<b>Ваш кошелек Bot:</b> <code>${userWallet ? userWallet : ''}</code>
`

    return messageText
  }

  static donationMadeMessage: string = `
😸 <b>Готово!</b> Спасибо за вашу щедрую поддержку! 🎉

Ваш вклад помогает Bot расти и развиваться, чтобы мы могли радовать вас новыми возможностями и лучшими сервисами.

Каждое пожертвование важно, и мы очень признательны за ваш вклад. 💖

🚀 Следите за обновлениями и новыми функциями — спасибо, что вы с нами! 🐾
`
}
