export class HelpMessages {
  static generalHelp = `
Как использовать <b>Bot Wallet Tracker Bot:</b>

🔮 Основные команды:
/start - Открыть главное меню
/add - Добавить кошелек(и)
/delete - Удалить кошелек(и)
/manage - Управлять отслеживаемыми кошельками
/upgrade - Обновить план Bot

🆘 Команды помощи:
/help_notify - Как использовать уведомления Bot
/help_group - Как добавить Bot в групповые чаты
`

  static groupsHelp = `
<b>Как добавить Bot в группы Telegram:</b>

1️⃣ Добавьте Bot администратором в вашем групповом чате
2️⃣ Отправьте /start в групповом чате
3️⃣ Отправьте /activate | после этого только активировавший сможет добавлять и удалять кошельки
4️⃣ Отправьте /add, чтобы начать добавлять кошельки
`

  static notifyHelp = `
<b>Как использовать Bot:</b>
1️⃣ Отправьте /start
2️⃣ Нажмите кнопку <b>Добавить</b>
3️⃣ Вставьте адрес, который хотите отслеживать

<b>Что значат уведомления Bot:</b>
<b>@</b> - Цена токена
<b>MC</b> - Рын. капитализация токена
<b>HOLDS</b> - Количество токенов и доля от эмиссии у этого кошелька
`
}
